{
  "backend/main.mo": "Motoko canister providing user profiles, presence tracking, access control, and chat messaging with validation.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of various frontend modules and components.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point containing root div and loading the frontend app bundle.",
  "frontend/src/App.tsx": "Root React component wiring providers and rendering Discovery, Chat, or Games screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to save a display name using profile APIs.",
  "frontend/src/components/chat/ChallengeBar.tsx": "UI bar allowing users to initiate Tic-Tac-Toe or Connect Four challenges via backend mutations.",
  "frontend/src/components/chat/ChatComposer.tsx": "Handles text and image message input, validation, and sending to the selected peer using hooks and UI controls.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders a chat message bubble with text, optional image, and timestamp formatting.",
  "frontend/src/components/chat/TypingIndicator.tsx": "Displays a simple animated typing indicator.",
  "frontend/src/components/connection/ConnectionHealth.tsx": "Shows a badge indicating whether the app is connected or disconnected.",
  "frontend/src/components/discovery/DeviceCard.tsx": "Displays device info and last-seen status with a button to initiate connection.",
  "frontend/src/components/discovery/RadarScan.tsx": "Shows an animated radar-style scanning visualization.",
  "frontend/src/components/games/GameStateDebugPanel.tsx": "Renders a scrollable JSON view of a game's state for debugging.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, navigation, theme switch, login, and data-clear controls.",
  "frontend/src/games/connect4/ConnectFourBoard.tsx": "Renders the Connect Four game UI and handles move submission and game resets via backend mutations.",
  "frontend/src/games/connect4/engine.ts": "Implements Connect Four game logic including move handling, win detection, and initial state creation.",
  "frontend/src/games/connect4/types.ts": "Defines TypeScript types for Connect Four players, board, status, and game state.",
  "frontend/src/games/tictactoe/engine.ts": "Implements Tic-Tac-Toe game logic including initial state, move handling, and winner detection.",
  "frontend/src/games/tictactoe/TicTacToeBoard.tsx": "React component rendering the Tic-Tac-Toe board, handling moves, resets, and syncing state with the backend.",
  "frontend/src/games/tictactoe/types.ts": "Type definitions for Tic-Tac-Toe players, board, game status, and state structure.",
  "frontend/src/hooks/queryKeys.ts": "Defines reusable React Query keys for profiles, peers, messages, and game states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/usePersistentState.ts": "Custom hook syncing React state with localStorage for persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, presence, messages, and game-related operations.",
  "frontend/src/hooks/useTypingIdle.ts": "Tracks typing activity with a timeout to indicate when a user stops typing.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables for light and dark modes.",
  "frontend/src/lib/chatLimits.ts": "Defines max allowed text and image sizes for chat messages.",
  "frontend/src/lib/fileToUint8Array.ts": "Converts a File object into a Uint8Array using FileReader.",
  "frontend/src/lib/gameSerialization.ts": "Serializes and deserializes Tic-Tac-Toe and Connect Four game states to and from JSON.",
  "frontend/src/lib/heartbeatSimulation.ts": "Simulates periodic heartbeat updates for connection health monitoring.",
  "frontend/src/lib/imageEncoding.ts": "Provides utilities to convert files to base64 data URLs and decode data URLs to blobs.",
  "frontend/src/lib/localPersistence.ts": "Utility helpers for safe localStorage load, save, and remove operations.",
  "frontend/src/lib/simulatedDiscovery.ts": "Provides a mock device discovery function returning randomized last-seen times.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers.",
  "frontend/src/screens/ChatScreen.tsx": "Renders chat UI, loading states, and message list based on peer connection and identity.",
  "frontend/src/screens/DiscoveryScreen.tsx": "Handles peer discovery, presence updates, scanning flow, and connection state UI.",
  "frontend/src/screens/GamesScreen.tsx": "Displays game library, active game state, and handles loading and error states for peer-based games.",
  "frontend/src/state/localNexusStore.tsx": "Defines context and state management for connection status and selected peer.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL or session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and design tokens for the frontend.",
  "project_state.json": "Defines the project’s state for building the LocalNexus React web app, including architectural constraints, feature list, and platform limitations. Contains notes on offline behavior, networking, UI framework, and existing implemented features."
}