{
  "backend/main.mo": "Motoko canister handling auth, user profiles, presence tracking, and chat messaging with permission checks and message validation.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or planning.",
  "frontend/index.css": "Tailwind CSS configuration defining color tokens, themes, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Main React component configuring providers and routing between Discovery, Chat, and Games screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save a display name.",
  "frontend/src/components/chat/ChallengeBar.tsx": "Dropdown for initiating backend-driven Tic-Tac-Toe or Connect Four challenges with auto-accept logic.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input component handling text and image messages, enforcing size limits and sending via mutation hooks.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders individual chat messages with optional images and timestamps, supporting self and peer alignment.",
  "frontend/src/components/chat/TypingIndicator.tsx": "Displays a simple animated indicator showing that the user is typing.",
  "frontend/src/components/connection/ConnectionHealth.tsx": "Shows a badge indicating whether the local connection state is connected or disconnected.",
  "frontend/src/components/discovery/DeviceCard.tsx": "Card UI for discovered devices showing activity status and a connect button.",
  "frontend/src/components/discovery/RadarScan.tsx": "Animated radar-style scanning visual used during device discovery.",
  "frontend/src/components/games/GameStateDebugPanel.tsx": "Debug panel that displays any game state as pretty-printed JSON inside a scrollable area.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with header, theme toggle, login, connection status, data clearing, and screen navigation.",
  "frontend/src/games/connect4/ConnectFourBoard.tsx": "UI for playing Connect Four, handling moves, resets, and rendering the board with status indicators.",
  "frontend/src/games/connect4/engine.ts": "Core Connect Four logic including state initialization, move handling, and win/draw detection.",
  "frontend/src/games/connect4/types.ts": "Type definitions for Connect Four players, board cells, game status, and overall state.",
  "frontend/src/games/tictactoe/engine.ts": "Implements Tic-Tac-Toe game logic including move validation, win checking, and state updates.",
  "frontend/src/games/tictactoe/TicTacToeBoard.tsx": "React UI for Tic-Tac-Toe that handles moves, reset actions, and syncing game state with a peer via mutations.",
  "frontend/src/games/tictactoe/types.ts": "Defines TypeScript types for Tic-Tac-Toe players, board, game status, and state structure.",
  "frontend/src/hooks/queryKeys.ts": "Provides centralized React Query key generators for profiles, peers, messages, and game state.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and hooks for loading, logging in, and clearing Internet Identity sessions.",
  "frontend/src/hooks/usePersistentState.ts": "Custom hook that syncs React state to localStorage with automatic load and save behavior.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, presence, messages, and game interactions using the backend actor.",
  "frontend/src/hooks/useTypingIdle.ts": "Tracks typing activity and exposes an idle flag based on a timeout.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/lib/chatLimits.ts": "Defines maximum allowed text and image sizes for chat messages.",
  "frontend/src/lib/fileToUint8Array.ts": "Converts browser File objects into Uint8Array buffers using FileReader.",
  "frontend/src/lib/gameSerialization.ts": "Serializes and deserializes Tic-Tac-Toe and Connect Four game states to and from JSON strings.",
  "frontend/src/lib/heartbeatSimulation.ts": "Simulates periodic connection health updates via a timed callback.",
  "frontend/src/lib/imageEncoding.ts": "Provides utilities for converting files to base64 data URLs and data URLs to Blob objects.",
  "frontend/src/lib/localPersistence.ts": "Helpers for loading, saving, and removing JSON data in localStorage with error handling.",
  "frontend/src/lib/simulatedDiscovery.ts": "Provides a mock device discovery function returning randomized last-seen timestamps for demo devices.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and renders the main App component.",
  "frontend/src/screens/ChatScreen.tsx": "Displays chat messages, connection status, and message composer, handling authentication and message loading states.",
  "frontend/src/screens/DiscoveryScreen.tsx": "Manages peer discovery, presence updates, and connection state, showing scanning UI and peer counts.",
  "frontend/src/screens/GamesScreen.tsx": "Shows minigame options or active game state for a connected peer, handling authentication and loading errors.",
  "frontend/src/state/localNexusStore.tsx": "Defines context for managing local connection state and selected peer with setters and reset helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s versioned state, architecture notes, and implemented features for a React web app with a Motoko backend. Contains requirements for UI screens, visual theme, simulated device discovery, chat features, and local image handling."
}