{
  "kind": "build_request",
  "title": "Remove demo-only simulated connection messaging and polish user-facing copy for publish readiness",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Remove or revise the Discovery screen demo-only note about simulated peer-to-peer connections so that the live app does not present itself as a simulation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8"
        ],
        "quotes": [
          "it says :Note: Peer-to-peer connections are simulated in this demo. In a production app, you would see a list of available peers here.",
          "yes do that"
        ]
      },
      "acceptanceCriteria": [
        "The text \"Note: Peer-to-peer connections are simulated in this demo. In a production app, you would see a list of available peers here.\" is no longer shown anywhere in the Discovery flow.",
        "Discovery still renders a helpful, English explanation of the current state (e.g., peers online vs none online) without referring to the app as a demo or simulation.",
        "No TypeScript errors or runtime console errors are introduced by this change."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Polish user-facing copy and presentation for publish readiness by removing informal/placeholder phrasing and replacing it with consistent, professional English across the main shell and core screens (Discovery/Chat/Games) without changing the top-level navigation structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "yes do that"
        ]
      },
      "acceptanceCriteria": [
        "User-facing text across Discovery, Chat, Games, and the global AppShell footer reads consistently and professionally (no demo disclaimers).",
        "Remove the heart emoji from the AppShell footer sentence so the footer reads as plain English.",
        "All user-facing text remains in English.",
        "No changes are made to the app’s top-level navigation tabs (Discovery/Chat/Games) or their structure."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components); compose them instead.",
    "Do not modify any paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend as a single Motoko actor in backend/main.mo; no additional backend services."
  ],
  "nonGoals": [
    "Implementing real device discovery (NSD/Wi‑Fi Direct) or any native/mobile networking.",
    "Adding new navigation destinations or changing the top-level navigation structure.",
    "Re-architecting the peer discovery model beyond copy/presentation changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer professional, non-demo user-facing copy for live/publish-ready builds."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}