{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove demo simulation messaging and polish publish-ready copy across core screens",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Remove demo-only simulated-connection note from Discovery and replace with a helpful, non-demo status explanation.",
      "acceptanceCriteria": [
        "The text \"Note: Peer-to-peer connections are simulated in this demo. In a production app, you would see a list of available peers here.\" is no longer shown anywhere in the Discovery flow.",
        "Discovery still renders a helpful, English explanation of the current state (e.g., peers online vs none online) without referring to the app as a demo or simulation.",
        "No TypeScript errors or runtime console errors are introduced by this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/DiscoveryScreen.tsx",
          "operation": "modify",
          "description": "Remove the demo/simulation disclaimer copy from the \"found\" state card and replace it with professional, publish-ready Discovery messaging that explains the current state (e.g., peers online vs none online) without calling the app a demo or simulation."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Polish user-facing copy across Discovery/Chat/Games and the AppShell footer for a professional publish-ready experience without changing top-level navigation.",
      "acceptanceCriteria": [
        "User-facing text across Discovery, Chat, Games, and the global AppShell footer reads consistently and professionally (no demo disclaimers).",
        "Remove the heart emoji from the AppShell footer sentence so the footer reads as plain English.",
        "All user-facing text remains in English.",
        "No changes are made to the app’s top-level navigation tabs (Discovery/Chat/Games) or their structure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update footer wording to remove the heart emoji and ensure professional, consistent English; do not change the Discovery/Chat/Games tab labels or navigation structure."
        },
        {
          "path": "frontend/src/screens/DiscoveryScreen.tsx",
          "operation": "modify",
          "description": "Polish Discovery screen user-facing copy for consistency and professionalism (e.g., \"log in\" phrasing, status messages) while preserving existing UI flow and without adding new navigation."
        },
        {
          "path": "frontend/src/screens/ChatScreen.tsx",
          "operation": "modify",
          "description": "Polish Chat screen user-facing copy for consistent, professional English (e.g., authentication and connection guidance text) without altering the screen structure or navigation."
        },
        {
          "path": "frontend/src/screens/GamesScreen.tsx",
          "operation": "modify",
          "description": "Polish Games screen user-facing copy for consistent, professional English (e.g., authentication and connection guidance text, empty states) without altering the screen structure or navigation."
        }
      ]
    }
  ]
}